Repository: almahmudbd/order-notification-for-telegram
Catalog: languages/nktgnfw-*.po
Languages: bn

source: Telegram Notifications
bn: টেলিগ্রাম নোটিফিকেশন

source: Telegram Notifications for WooCommerce
bn: WooCommerce এর জন্য টেলিগ্রাম নোটিফিকেশন

source: Version %s
bn: ভার্সন %s

source: By %s
bn: ডেভেলপার: %s

source: Basic Settings
bn: বেসিক সেটিংস

source: Bot Token
bn: বট টোকেন

source: Enter your Telegram bot token from @BotFather
bn: @BotFather থেকে পাওয়া আপনার টেলিগ্রাম বট টোকেন দিন

source: Chat ID
bn: চ্যাট আইডি

source: Enter your Telegram chat ID from @userinfobot
bn: @userinfobot থেকে পাওয়া আপনার টেলিগ্রাম চ্যাট আইডি দিন

source: Notification Settings
bn: নোটিফিকেশন সেটিংস

source: Send Notifications On
bn: কখন নোটিফিকেশন পাঠাবে

source: New Order Only
bn: শুধু নতুন অর্ডার

source: Order Status Change
bn: অর্ডার স্ট্যাটাস পরিবর্তনে

source: Choose when to send notifications
bn: কখন নোটিফিকেশন পাঠানো হবে সেটি নির্বাচন করুন

source: Order Statuses
bn: অর্ডার স্ট্যাটাস সমূহ

source: Select order statuses that trigger notifications (Only applicable if "Order Status Change" is selected above)
bn: যে স্ট্যাটাসে নোটিফিকেশন যাবে সেগুলো নির্বাচন করুন (শুধু তখনই কাজ করবে যখন উপরে “অর্ডার স্ট্যাটাস পরিবর্তনে” সিলেক্ট করা থাকে)

source: Quantity in Bangla
bn: পরিমাণ বাংলা সংখ্যা

source: Show quantity using Bangla digits (e.g., ২পিস). If unchecked, uses English digits (e.g., 2pcs).
bn: পরিমাণ বাংলায় দেখাবে (যেমন ২পিস)। আনচেক থাকলে ইংরেজিতে দেখাবে (যেমন 2pcs)।

source: Message Template
bn: মেসেজ টেমপ্লেট

source: Customize your notification message using the placeholders below.
bn: নিচের প্লেসহোল্ডার ব্যবহার করে নোটিফিকেশন মেসেজ কাস্টমাইজ করুন।

source: Quick Setup Guide:
bn: দ্রুত সেটআপ গাইড:

source: Create a Telegram bot: Message %s and send:
bn: টেলিগ্রাম বট তৈরি করুন: %s এ মেসেজ দিয়ে পাঠান:

source: Follow the instructions and copy the bot token
bn: নির্দেশনা অনুসরণ করে বট টোকেন কপি করুন

source: Get your Chat ID: Message %s and send %s
bn: আপনার চ্যাট আইডি নিন: %s এ মেসেজ দিন এবং %s পাঠান

source: Enter both the Bot Token and Chat ID below
bn: নিচে বট টোকেন এবং চ্যাট আইডি দুটোই দিন

source: Template Guide
bn: টেমপ্লেট গাইড

source: Available Placeholders
bn: উপলব্ধ প্লেসহোল্ডার

source: Supported HTML Tags
bn: সমর্থিত HTML ট্যাগ

source: Example Template
bn: উদাহরণ টেমপ্লেট

source: Tip: underscore/dash দুটোই কাজ করে (e.g. {billing_phone} বা {billing-phone}).
bn: টিপস: আন্ডারস্কোর/ড্যাশ দুটোই কাজ করে (যেমন {billing_phone} অথবা {billing-phone})।

source: Test Your Settings
bn: সেটিংস পরীক্ষা করুন

source: Send a test message to verify your Telegram notification settings.
bn: টেলিগ্রাম নোটিফিকেশন সেটিংস ঠিক আছে কি না যাচাই করতে একটি টেস্ট মেসেজ পাঠান।

source: Send Test Message
bn: টেস্ট মেসেজ পাঠান

source: Test message sent successfully! Check your Telegram.
bn: টেস্ট মেসেজ সফলভাবে পাঠানো হয়েছে! টেলিগ্রাম চেক করুন।

source: Failed to send test message. Please check your settings.
bn: টেস্ট মেসেজ পাঠানো যায়নি। দয়া করে সেটিংস চেক করুন।

source: Error: Could not send test message.
bn: ত্রুটি: টেস্ট মেসেজ পাঠানো সম্ভব হয়নি।

source: Order Notification For Telegram
bn: অর্ডার নোটিফিকেশন ফর টেলিগ্রাম

source: Send WooCommerce order notifications to Telegram.
bn: WooCommerce অর্ডার নোটিফিকেশন টেলিগ্রামে পাঠান।
